tap "heroku/brew"
tap "hashicorp/tap"
tap "sudar/arduino-mk"
tap "thoughtbot/formulae"

# Core utilities
brew "asciiquarium"
brew "astyle"
brew "autoconf"
brew "automake"
brew "bat"
brew "btop"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "gh"
brew "gnupg", link: false
brew "graphviz"
brew "imagemagick"
brew "lazygit"
brew "llvm"
brew "mas"
brew "mise"
brew "mono", link: false
brew "pinentry-mac"
brew "postgresql", restart_service: true
brew "prettier"
brew "rcm"
brew "ruff"
brew "redis", restart_service: true
brew "ripgrep"
brew "starship"
brew "hashicorp/tap/terraform-ls"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "wget"
brew "yarn"
brew "zlib"
brew "zoxide"

# Shell
brew "antidote"

# Heroku
brew "heroku/brew/heroku"

# Casks
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "mactex"
cask "purevpn"
cask "skim"
cask "slack"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "xquartz"

# Mac App Store
mas "Magnet", id: 441258766
