tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "sudar/arduino-mk"
tap "thoughtbot/formulae"
brew "asciiquarium"
brew "astyle"
brew "autoconf"
brew "automake"
brew "bat"
brew "python@3.9"
brew "llvm"
brew "ccls"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "exa"
brew "fzf"
brew "gawk"
brew "gdb"
brew "gnupg", link: false
brew "graphviz"
brew "imagemagick"
brew "mas"
brew "mono", link: false
brew "nvm"
brew "pinentry-mac"
brew "postgresql", restart_service: true
brew "rcm"
brew "redis", restart_service: true
brew "ripgrep"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zlib"
brew "heroku/brew/heroku"
cask "font-fira-code"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "mactex"
cask "purevpn"
cask "skim"
cask "slack"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "xquartz"
mas "Magnet", id: 441258766
