tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "sudar/arduino-mk"
tap "thoughtbot/formulae"
cask "xquartz"
brew "python"
brew "asciiquarium"
brew "cmake"
brew "ctags"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gnupg"
brew "imagemagick"
brew "mas"
brew "mono", link: false
brew "pinentry-mac"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "xdotool"
brew "sudar/arduino-mk/arduino-mk"
brew "thoughtbot/formulae/rcm"
cask "arduino"
cask "font-fira-code"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "mactex"
cask "purevpn"
cask "skim"
cask "slack"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
mas "Todoist", id: 585829637
mas "ToyViewer", id: 414298354
